# Экзамен по курсу "Аналитика данных на Python"

Этот тест проверит Ваши навыки работы с таблицами данных с помощью библиотек pandas и numpy. Задания делятся на простые (⭐️), средние (⭐️⭐️) и сложные (⭐️⭐️⭐️). Решение простых заданий, как правило, требует одной-двух операций с таблицами, тогда как для более сложных может потребоваться несколько последовательных преобразований данных.

##  Предыстория

Сегодня Ваш первый день работы в крупном интернет-магазине, который продаёт товары с доставкой по всему миру. Ваша первая задача – проанализировать базу данных покупок, совершённых в магазине за последние несколько лет. База содержит информацию об отдельных транзакциях, про каждую из которых известны номер инвойса (InvoiceNo), дата инвойса(InvoiceDate), код товара (StockCode), описание товара(Description), количество товара в транзакции (Quantity), стоимость единицы товара (UnitPrice), код покупателя (CustomerID), страна покупателя (Country).

База выгружена для Вас в формате CSV: файл [```online-retail.csv```](https://drive.google.com/file/d/1O1oJtpEu-u6s6xTu7seQfnNcQjYCt0GF/view?usp=sharing)

In [1]:
import numpy as np
import pandas as pd

## ⭐️ Вопрос 1

Загрузите данные из файла online-retail.csv в переменную типа pandas DataFrame

Подсказка: Используйте функцию из библиотеки pandas

Какой символ-разделитель используется в этом файле?

* Запятая ","
* Двоеточие ":"
* Точка с запятой ";"
* Символ табуляции "tab"

#### Решение

In [2]:
df = pd.read_csv('online-retail.csv', sep=';', dayfirst=False)
df.head()
# Точка с запятой ";"

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

## ⭐️ Вопрос 2

Сколько строк в полученной таблице (не считая заголовков столбцов)?

#### Решение

In [3]:
df.shape
# 541911

(541911, 8)

## ⭐️ Вопрос 3

Сколько столбцов в полученной таблице (не считая индекса)?

#### Решение

In [4]:
df.shape
# 8

(541911, 8)

## ⭐️ Вопрос 4

Как называется столбец с самым коротким названием?

#### Решение

In [5]:
df.columns.min()

'Country'

## ⭐️ Вопрос 5

В скольких столбцах встречаются пропущенные значения? (ответ - целое число)

#### Решение

In [6]:
# df.info()
df.isnull().any().sum()

#В 2х столбцах

2

## ⭐️ Вопрос 6

Сколько пропущенных значений в столбце CustomerID? (ответ - целое число)

#### Решение

In [7]:
df.CustomerID.isnull().sum()

135080

## ⭐️⭐️ Вопрос 7

Посмотрим, данные за какой исторический период у нас есть. 

Данные за какой самый ранний и за какой самый поздний годы содержатся в датасете? В ответе укажите два целых числа через запятую.

#### Решение

In [8]:
# df['InvoiceDate'].sort_values().min()
# df['InvoiceDate'].sort_values().max()
print('2010, 2011')

2010, 2011

## ⭐️ Вопрос 8

Каковы минимальная и максимальная цена товаров (UnitPrice)? Перечислите через запятую. Цена в этом задании может принимать отрицательные значения.

#### Решение

In [9]:
print(f'{df.UnitPrice.min()}, {df.UnitPrice.max()}')

-11062.06, 38970.0

## ⭐️ Вопрос 9

В таблице оказались товары с отрицательными ценами! Это явно какая-то ошибка. Какое описание (Description) у таких транзакций? Перечислите все варианты через запятую, отсортировав строки по алфавиту.

#### Решение

In [10]:
df[df['UnitPrice'] < 0]['Description'].sort_values(ascending=True)

299983    Adjust bad debt
299984    Adjust bad debt
Name: Description, dtype: object

## ⭐️ Вопрос 10

Поищем ещё возможные проблемы с данными. Как насчёт товаров с нулевыми ценами? 

Сколько в таблице транзакций с нулевой ценой? А с пропусками на месте цены? 

Перечислите два целых числа через запятую.

#### Решение

In [11]:
a = len(df.query("UnitPrice == 'Nan'"))
print(f'{len(df.query("UnitPrice == 0"))}, {a}')

2515, 0

## ⭐️⭐️ Вопрос 11

Для дальнейшего анализа поведения покупателей нам понадобится набор данных, в которых у каждой транзакции корректно указана цена, количество единиц товара (Quantity) и id покупателя (CustomerID). Удалите из таблицы все строки, в которых цена не превосходит 0 или пропущена, или количество единиц товара не превосходит 0 или пропущено, или в которых пропущен id покупателя. 

Сколько строк осталось?

#### Решение

In [3]:
# Очищаем от пропущенных значений
df.dropna(subset=['Quantity', 'UnitPrice', 'CustomerID'], inplace=True)

# Выводим ДФ, где значения удовлетворяют условию
df_cln = df[(df['UnitPrice'] > 0) & (df['Quantity'] > 0)]
df_cln.shape[0]

397886

## Внимание! 

### Везде далее мы работаем с очищенной таблицей, полученной в Вопросе 11.

## ⭐️⭐️ Вопрос 12

В таблице для каждой транзакции указаны цена за единицу товара (UnitPrice) и количество единиц товара (Quantity). Вычислите для каждой транзакции её **полную стоимость** и сохраните в новом столбце Price, который добавьте в таблицу. 

Каковы минимальная и максимальная полная стоимость транзакций? Перечислите через запятую, округлив до целых чисел.

#### Решение

In [4]:
df_cln['Price'] = df_cln['UnitPrice'] * df_cln['Quantity']
min = round(df_cln['Price'].min()) #т.к. 0 быть не может, а значения price десятые доли (0.1, 0.3) то считаем 1
max = round(df_cln['Price'].max())
print(f'{min + 1}, {max}')

1, 168470

C:\CONDA\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

## ⭐️⭐️ Вопрос 13

В нашей базе данных каждая покупка представлена одной или несколькими транзакциями. Покупка однозначно определяется своим номером инвойса (InvoiceNo). Транзакции, относящиеся к одной покупке, имеют один и тот же InvoiceNo. 

Стоимость всей покупки равна сумме полных стоимостей транзакций, входящих в неё. Найдите стоимости трёх самых дорогих покупок. Перечислите через запятую в порядке убывания, округлив до целых чисел.

#### Решение

In [14]:
high_price = df_cln.groupby('InvoiceNo').sum().sort_values(by='Price', ascending = False).head(3)
a, b, c = round(high_price['Price'])
print(f'{a}, {b}, {c}')

168470.0, 77184.0, 38970.0

## ⭐️⭐️ Вопрос 14

Какой товар составил наибольшую выручку? В ответе укажите описание товара (дословно строку из соответствующего поля в столбце Description).

#### Решение

In [15]:
df_cln.groupby('Description').sum().sort_values(by = 'Price', ascending=False).index[0]

'PAPER CRAFT , LITTLE BIRDIE'

## ⭐️⭐️ Вопрос 15

Создайте новую таблицу purchases, в которой каждая строка будет соответствовать отдельной покупке, со столбцами 
InvoiceNo, InvoiceDate, Price, CustomerID, Country.

Поскольку дата InvoiceDate может быть отличаться для разных транзакций внутри одной покупки, при группировке возьмите самую раннюю из дат. Также отсортируйте её по датам по возрастанию.

Учтите, что InvoiceDate — не уникальное поле, данные стоит дополнительно отсортировать по InvoiceNo, перед тем как брать первое значение группы.

Сколько получилось строк?

#### Решение

In [12]:
purchases = df_cln.groupby('InvoiceNo').agg({'InvoiceDate':'min', 'Price':'sum', 'CustomerID':'first', 'Country':'first'})
purchases

                  InvoiceDate   Price  CustomerID         Country
InvoiceNo
536365    2010-12-01 08:26:00  139.12     17850.0  United Kingdom
536366    2010-12-01 08:28:00   22.20     17850.0  United Kingdom
536367    2010-12-01 08:34:00  278.73     13047.0  United Kingdom
536368    2010-12-01 08:34:00   70.05     13047.0  United Kingdom
536369    2010-12-01 08:35:00   17.85     13047.0  United Kingdom
...                       ...     ...         ...             ...
581584    2011-12-09 12:25:00  140.64     13777.0  United Kingdom
581585    2011-12-09 12:31:00  329.05     15804.0  United Kingdom
581586    2011-12-09 12:49:00  339.20     13113.0  United Kingdom
581587    2011-12-09 12:50:00  249.45     12680.0          France
581588    2011-12-09 12:52:00   37.80     12594.0           Italy

[18533 rows x 4 columns]

## ⭐️⭐️ Вопрос 16

Исследуем, растут или убывают покупки наших клиентов после их первой покупки на сайте. Найдите среднюю цену первых покупок клиентов: для каждого клиента возьмите его первую покупку и усредните эти значения. Найдите среднюю цену покупок в целом. Округлите эти числа до целых и перечислите в этом порядке через запятую.

\* При равных TimeStamp по покупкам первой считается покупка с меньшим InvoiceNo.

#### Решение

In [26]:
a = purchases.groupby('CustomerID').agg({'Price':'first'}).mean()
print(f'{round(purchases.Price.mean())}, {round(a, 3)}')

481, Price    425.657
dtype: float64

## ⭐️⭐️⭐️ Вопрос 17

В какой день недели было наибольшее число покупок? В ответе укажите русское название дня недели, начинающееся с заглавной буквы.


Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите день недели, в который она была совершена. Сохраните в новый столбец.
* Сгруппируйте таблицу по дням недели.

#### Решение

In [18]:
purchases['InvoiceDate'] = pd.to_datetime(purchases['InvoiceDate'])
# purchases.info()
purchases['week_day'] = purchases['InvoiceDate'].dt.weekday_name
purchases.groupby('week_day').count().sort_values(by='InvoiceNo', ascending=False)
print('Четверг')

Четверг

## ⭐️⭐️⭐️ Вопрос 18

В какой год и месяц выручка была максимальной?

Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите год и месяц, в которые она была совершена. Сохраните в новые столбцы.
* Сгруппируйте таблицу по новым столбцам

В ответе укажите два целых числа через запятую: год, месяц

#### Решение

In [2]:
df_cln['InvoiceDate'] = pd.to_datetime(df_cln['InvoiceDate'])
df_cln['month'] = df_cln['InvoiceDate'].dt.month
df_cln['year'] = df_cln['InvoiceDate'].dt.year
df_cln.groupby(['year', 'month']).sum().sort_values(by='Price', ascending=False).head(5)

NameError: name 'pd' is not defined

## ⭐️⭐️⭐️ Вопрос 19

Магазин продаёт товары покупателям из разных стран (Country). В какой стране был наибольший процентный рост месячных продаж, если сравнить март 2011 и сентябрь 2011? Сколько процентов составил этот рост? В расчёт брать только страны, в которых были ненулевые продажи в обоих этих месяцах. В ответе укажите через запятую название страны и целое число (процентный рост, округлённый до целого числа).

#### Решение

In [38]:
grouped = df_cln.groupby(['Country', 'year', 'month'])['Price'].sum().reset_index()
grouped_limited = grouped.query('year == 2011 and ((month == 3) or (month == 9))')
pivoted = pd.pivot_table(grouped_limited, index='Country', columns='month', values='Price').reset_index()
pivoted['percent_changed'] = round(pivoted[9] / pivoted[3] * 100 - 100)
pivoted

month               Country          3           9  percent_changed
0                 Australia   17223.99    5106.730            -70.0
1                   Austria    1708.12         NaN              NaN
2                   Belgium    3351.98    4208.020             26.0
3                    Canada     140.54         NaN              NaN
4           Channel Islands    3509.33    1323.750            -62.0
5                    Cyprus     938.39     196.350            -79.0
6                   Denmark    3978.99    4570.160             15.0
7                      EIRE   21674.36   40995.490             89.0
8                   Finland    5936.82    1105.450            -81.0
9                    France   14589.55   23428.040             61.0
10                  Germany   14392.69   18091.220             26.0
11                   Greece     387.31         NaN              NaN
12                    Italy    1806.81     279.800            -85.0
13                    Japan      48.90     112.080            129.0
14              Netherlands   22416.49   26937.260             20.0
15                   Norway    1265.31    8678.940            586.0
16                   Poland     317.78     529.250             67.0
17                 Portugal    2660.85    1433.220            -46.0
18                    Spain    5363.15    5189.240             -3.0
19                   Sweden    4720.58    4575.210             -3.0
20              Switzerland    1870.23    8284.860            343.0
21     United Arab Emirates        NaN    1013.040              NaN
22           United Kingdom  467198.59  796780.272             71.0

## ⭐️⭐️⭐️ Вопрос 20

Большинство клиентов все свои покупки делают из одной и той же страны. Выясним, однако, насколько велика доля путешественников среди клиентов. 
Сколько клиентов сделали покупки по крайней мере из двух разных стран? (ответ - целое число)

#### Решение

In [23]:
# Создадим список уникальных id покупателей. Пусть для каждого покупателя буедт определен списко стран где он покупал.
ids_list = list(df_cln['CustomerID'].sort_values().unique())
id_dict = {}

for id_ in ids_list:
    unique_country_id = list(df_cln[df_cln['CustomerID'] == id_].Country.unique())
    id_dict[id_] = unique_country_id

In [24]:
raw =[[(i, j) for j in id_dict[i]] for i in id_dict]
# переводим из словаря к более удобному виду
foreigners = list(itertools.chain(*raw))
# создаём DataFrame
foreigners_df = pd.DataFrame(foreigners, columns = ['CustomerID', 'Country'])

# Так как количество стран и покупателей уже уникально, то посчитаем количество стран для покупателя
travel = foreigners_df.groupby('CustomerID').count()
travel[travel['Country'] > 1].count()[0]

8

## ⭐️⭐️⭐️ Вопрос 21

Мы запускаем в Италии рекомендательную систему "С этим товаром часто покупают...", и для этого хотим узнать, какие различные товары чаще всего встречаются в одной покупке из этой страны. Определите, какая пара различных товаров чаще всего встречается в различных покупках с ```Country=='Italy'```, и в скольких покупках это происходит. Одинаковые товары или нет, проверяйте по равенству поля Description. 

(ответ: название (Description) первого товара, название (Description) второго товара, целое число)

#### Решение

In [32]:
it = df_cln.query('Country == ["Italy"]')
it

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
7214,537022,22791,T-LIGHT GLASS FLUTED ANTIQUE,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.00
7215,537022,21287,SCENTED VELVET LOUNGE CANDLE,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.00
7216,537022,79337,BLUE FLOCK GLASS CANDLEHOLDER,6,2010-12-03 15:45:00,1.65,12725.0,Italy,9.90
7217,537022,85111,SILVER GLITTER FLOWER VOTIVE HOLDER,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.00
7218,537022,85038,6 CHOCOLATE LOVE HEART T-LIGHTS,6,2010-12-03 15:45:00,2.10,12725.0,Italy,12.60
...,...,...,...,...,...,...,...,...,...
529691,580746,48138,DOORMAT UNION FLAG,2,2011-12-06 09:35:00,8.25,12584.0,Italy,16.50
529692,580746,22627,MINT KITCHEN SCALES,2,2011-12-06 09:35:00,8.50,12584.0,Italy,17.00
529693,580746,22720,SET OF 3 CAKE TINS PANTRY DESIGN,9,2011-12-06 09:35:00,4.95,12584.0,Italy,44.55
541909,581588,22380,TOY TIDY SPACEBOY,9,2011-12-09 12:52:00,2.10,12594.0,Italy,18.90
541910,581588,22381,TOY TIDY PINK POLKADOT,9,2011-12-09 12:52:00,2.10,12594.0,Italy,18.90

In [33]:
it[['InvoiceNo', 'Description']]

       InvoiceNo                          Description
7214      537022         T-LIGHT GLASS FLUTED ANTIQUE
7215      537022         SCENTED VELVET LOUNGE CANDLE
7216      537022        BLUE FLOCK GLASS CANDLEHOLDER
7217      537022  SILVER GLITTER FLOWER VOTIVE HOLDER
7218      537022      6 CHOCOLATE LOVE HEART T-LIGHTS
...          ...                                  ...
529691    580746                   DOORMAT UNION FLAG
529692    580746                  MINT KITCHEN SCALES
529693    580746     SET OF 3 CAKE TINS PANTRY DESIGN
541909    581588                    TOY TIDY SPACEBOY
541910    581588               TOY TIDY PINK POLKADOT

[760 rows x 2 columns]

In [35]:
merge = pd.merge(it[['InvoiceNo', 'Description']], it[['InvoiceNo', 'Description']], on='InvoiceNo', how='inner')
merge

,InvoiceNo,Description_x,Description_y
0,537022,T-LIGHT GLASS FLUTED ANTIQUE,T-LIGHT GLASS FLUTED ANTIQUE
1,537022,T-LIGHT GLASS FLUTED ANTIQUE,SCENTED VELVET LOUNGE CANDLE
2,537022,T-LIGHT GLASS FLUTED ANTIQUE,BLUE FLOCK GLASS CANDLEHOLDER
3,537022,T-LIGHT GLASS FLUTED ANTIQUE,SILVER GLITTER FLOWER VOTIVE HOLDER
4,537022,T-LIGHT GLASS FLUTED ANTIQUE,6 CHOCOLATE LOVE HEART T-LIGHTS
...,...,...,...
28743,580746,SET OF 3 CAKE TINS PANTRY DESIGN,SET OF 3 CAKE TINS PANTRY DESIGN
28744,581588,TOY TIDY SPACEBOY,TOY TIDY SPACEBOY
28745,581588,TOY TIDY SPACEBOY,TOY TIDY PINK POLKADOT
28746,581588,TOY TIDY PINK POLKADOT,TOY TIDY SPACEBOY
28747,581588,TOY TIDY PINK POLKADOT,TOY TIDY PINK POLKADOT

In [48]:
merged = merge[merge['Description_x'] != merge['Description_y']]
merged

,InvoiceNo,Description_x,Description_y
1,537022,T-LIGHT GLASS FLUTED ANTIQUE,SCENTED VELVET LOUNGE CANDLE
2,537022,T-LIGHT GLASS FLUTED ANTIQUE,BLUE FLOCK GLASS CANDLEHOLDER
3,537022,T-LIGHT GLASS FLUTED ANTIQUE,SILVER GLITTER FLOWER VOTIVE HOLDER
4,537022,T-LIGHT GLASS FLUTED ANTIQUE,6 CHOCOLATE LOVE HEART T-LIGHTS
5,537022,T-LIGHT GLASS FLUTED ANTIQUE,SET OF 6 T-LIGHTS SANTA
...,...,...,...
28740,580746,SET OF 3 CAKE TINS PANTRY DESIGN,RECIPE BOX RETROSPOT
28741,580746,SET OF 3 CAKE TINS PANTRY DESIGN,DOORMAT UNION FLAG
28742,580746,SET OF 3 CAKE TINS PANTRY DESIGN,MINT KITCHEN SCALES
28745,581588,TOY TIDY SPACEBOY,TOY TIDY PINK POLKADOT
28746,581588,TOY TIDY PINK POLKADOT,TOY TIDY SPACEBOY

In [51]:
merged.groupby(['Description_x', 'Description_y']).count().sort_values('InvoiceNo', ascending=False)

                                                                         InvoiceNo
Description_x                       Description_y
TOY TIDY PINK POLKADOT              TOY TIDY SPACEBOY                            6
TOY TIDY SPACEBOY                   TOY TIDY PINK POLKADOT                       6
PLASTERS IN TIN CIRCUS PARADE       PLASTERS IN TIN WOODLAND ANIMALS             5
PLASTERS IN TIN WOODLAND ANIMALS    PLASTERS IN TIN CIRCUS PARADE                5
PLASTERS IN TIN CIRCUS PARADE       POSTAGE                                      4
...                                                                            ...
GARDENIA 3 WICK MORRIS BOXED CANDLE T-LIGHT GLASS FLUTED ANTIQUE                 1
                                    SILVER GLITTER FLOWER VOTIVE HOLDER          1
                                    SET/3 VANILLA SCENTED CANDLE IN BOX          1
                                    SET OF 6 T-LIGHTS SNOWMEN                    1
ZINC FOLKART SLEIGH BELLS           WRAP RED VINTAGE DOILY                       1

[26492 rows x 1 columns]